{"c60s9e": "{\"id\": \"c60s9e\", \"user\": \"Prmas\", \"created_on\": \"2019-06-27@14:06:38\", \"title\": \"One Piece Chapter 947 SPOILERS\", \"body\": \"Source: @EtenBoby\\n\\n**Chapter Title:** Queen\\u2019s bet\\n\\n**Info:**\\n\\n\\\\- Luffy used the technique that was definitely used that Rayleigh back then, but he was so desperate during the process he couldn\\u2019t remember how exactly he was able to do it. \\n\\nBut what he just used surpasses the Ryuo that Grandpa Hyo was trying to taught him, if he could completely master it he\\u2019ll be able to save themselves from Big Mom\\u2019s punch.\\n\\n\\\\- Luffy and Grandpa Hyo were blown away when they try it for the second time and failed, Grandpa Hyo is fine because he was guarding with Ryuo. \\n\\n\\\\- Ryuo, or Haki, is an invisible armor that you can use for both defense and offense, but if you take it a stage farther, the Haki will become a power so great that it can reach the interior of the opponent\\u2019s body and destroy them from within.\\n\\n\\\\- Even though Luffy destroyed the collars from within unconsciously, but it\\u2019s good enough, after saying that Grandpa Hyo fall to the ground...While chasing Luffy, Big Mom destroys the mine and head towards the melting furnace. If Queen couldn\\u2019t stop her, of course the others wouldn\\u2019t be able to as well.\\n\\n\\\\- After regaining his consciousness, Queen has an idea and give out orders to his subordinates. If you head in a straight direction in Udon, you would definitely ended up coming back, when Big Mom actually came back,Queen uses oshiruko as a bait and attack her with Brachio Bombs which exploded on her head.\\n\\n\\\\- The impact help her regains her memories, and became very energetic. Queen and the others thought they were doomed but she fall asleep. \\n\\n\\\\- Taking this opportunity, Queen orders to tie her up with 100% pure seastone chain, which they wrap around her body 100 times, then injects her with 100% animal anesthesia. Aside from the minimum amount of guards, all of them needs to get on a boat and escort Big Mom to Onigashima before she wakes up. \\n\\n\\\\- After Queen and his subordinates left, Babanuki is in charge of Udon. Udon is completely cut off from the rest of the world because of the snail situation. Luffy starts rampaging since there\\u2019s no more opponents.\"}", "bxdj12": "{\"id\": \"bxdj12\", \"user\": \"Prmas\", \"created_on\": \"2019-06-06@16:43:12\", \"title\": \"One Piece Chapter 945 Spoilers\", \"body\": \"**Sources: @siyporg @redon**\\n\\n**Description:**\\n\\n\\\\- Big Mom beats Queen.\\n\\n\\\\- The chapter begins with Orochi escaping to his castle. Orochi looks back, seeing the explosions in the battle, and laughs at the situation.\\n\\n\\\\- Zoro and Kyoshiro continue to fight, while the first is angry and even somewhat tired, Kyoshiro maintains absolute coldness while fighting with him.\\n\\n\\\\- Orochi's Oniwabanshu comes on stage with Fukurokuju in front. Fukurokuju searches through some papers and sees Zoro's Wanted, then orders his subordinates to catch him.\\n\\n\\\\- One of the Oniwabanshu women plays her instrument and attacks Zoro with what appears to be sound waves.\\n\\n\\\\- Sanji has given Toko to Usopp to escape with her, which Usopp does at the moment XD\\n\\n\\\\- Drake tries to bite Sanji again, when he tries to dodge he notices that Drake's tail comes from one side and does not manage to dodge it.\\n\\n\\\\- Drake stamps it on the ground, but Sanji gets up without a problem.\\n\\n\\\\- Brook is responsible for protecting Hiyori, uses his soul to scare the members of the Oniwabanshu.\\n\\n\\\\- Law goes to the cage to try to get his nakamas but there is Hawkins to stop him.\\n\\n\\\\- Hawkins draws his sword and cuts one of his arms a little, but the wound goes to Shachi, who has been bewitched by Hawkins with Bepo and Penguin. The face that Law puts upon finding out is a poem.\\n\\n\\\\- Sanji continues to escape from Drake's bites, while escaping he sees Hiyori, who is being harassed by the Oniwabanshu (he locates her as if he had a telescopic XD scope).\\n\\n\\\\- Sanji goes to her to save her but Zoro goes ahead by taking the Oniwabanshu out of the way.\\n\\n\\\\- Hiyori grabs Zoro while he runs and despite the discomfort of the swordsman. Sanji breaks his heart to see the scene (another face to frame in this chapter XD).\\n\\n\\\\-We now go to the Kinemon group, which is outside the city.\\n\\n\\\\- We see that Kinemon is being beaten by Shutenmaru while Inuarashi asks them to stop.\\n\\n\\\\- Kinemon kneels before Shutenmaru asking him to join them, Shutenmaru takes a swig of sake and leaves.\\n\\n\\\\- We went to the prison. There is a great smoke and behind it a giant shadow.\\n\\n\\\\- Big Mom, on a brutal double page, appears before them. Everyone, from Luffy to Queen, to the rest of the prisoners or members of the Beast Pirates, are left with Enel's face when they see her.\\n\\n\\\\- Chopper, Kiku, Tama and Momonosuke have also entered the prison. Kiku decides to put a handkerchief on his head to go incognito.\\n\\n\\\\- Queen begins to transform immediately.\\n\\n\\\\- Luffy, realizing that Big Mom does not remember him, tells him if he can get 2 guys who are in the water (Kid and Killer are at the limit). Big Mom asks if there is Oshiruko there.\\n\\n\\\\- Queen has just transformed, is the user of the Ryu Ryu not My Brachiosaurus model. Queen tells Big Mom that all the Oshiruko there is is from him and that he does not intend to give her anything. His subordinates look at each other because they know that there is no Oshiruko for him either.\\n\\n\\\\- Chopper and Kiku come to the area where they are all together and suddenly they see Big Mom throw herself towards a dinosaur.\\n\\n\\\\- Big Mom, very pissed, stamped Queen on the floor with a single punch ...\\n\\n***BREAK NEXT WEEK***\\n\\n**Extra Info:**\\n\\n\\\\- An important phrase Zoro said about Kyoshiro reveals the sensitivity of Kyoshiro's personality and that he is an important and unusual personality.\\n\\n\\\\- After several strikes Zoro to Kyushiro felt the effort and stress then Zoro said to himself surprised: \\\"I wonder who this person is\\\"\\n\\n**Pics:**\\n\\n[Queen's Zoan Form](https://imgur.com/c5GYuin)\\n\\n(Translation: Queen: There\\u2019re still plenty of Oshiruko left but they\\u2019re all mine...I won\\u2019t give you even a drop of it old hag!!! Subordinates: (Actually there\\u2019s none left!!) Dragon-dragon fruit ancient model Brachiosaurus\\n\\n[Big Mom slamming Queen](https://imgur.com/2CXlwan)\\n\\n[Hawkins and Law](https://imgur.com/PNhLulm)\\n\\n[Shonen Jump Issue Cover](https://imgur.com/eCGTQZr)\\n\\n[Zoro, Hiyori and Sanji funny moment](https://imgur.com/FQA5SZ4)\\n\\n[First page](https://imgur.com/dS0blNM)\"}"}