{"c8xq79": {"id": "c8xq79", "user": "Prmas", "created_on": "2019-07-04@13:42:49", "title": "One Piece Chapter 948 SPOILERS", "body": "Source: @Etenboby and @sil5r<br><br>**Chapter Title: Introducing Kawamatsu the Kappa**<br><br>**New cover story: “The Fire Tank Pirates that had successfully escaped”**<br><br>**Info:**<br><br>To make sure things doesn’t get out of control, the prisoners stop Luffy.<br><br>In order to give the prisoners hope and to get them out of Luffy’s way, Kawamatsu receives the key and someone’s favorite sword and break out.<br><br>Okiku and Raizou has revealed their identities, and they sees that Grandpa Hyo really is Hyogoro.<br><br>Okiku is going to stop them from reporting to Kaido.<br><br>&#x200B;<br><br>***Break next week***<br><br>(The Info will get updated)<br><br>&#x200B;<br><br>**Additional Info:**<br><br>\\- Kiku's epithet is Remaining Snow.<br><br>\\- This chapter consists of 17 pages.<br><br>\\- A new kind of sword appears in the chapter. It's called **Love Sword** (愛刀) or something like that.<br><br>\\- Kawamatsu used to be the strongest Sumo wrestler. As wolfwood mentioned, Kawamatsu's first name Yokozuna is given to strongest Sumo wrestler.<br><br>\\- His sword is called Soto-musou (Sumo technique)<br><br>\\- Luffy is still fighting Queen's subordinates with Ryuo and Hyo watching him<br><br>\\- The prisoners trying to chain Luffy after Queen's subordinates arrange themselves and the leaders of the prison intervene to stop them<br><br>\\- When the prisoners trying to stop Luffy it's a comedy panel<br><br>\\- Queen's subordinates trying to enter Kawamatsu jail<br><br>\\- While Kawamastsu is inside his shadow appears (silhouette)<br><br>\\- Out of sudden Raizou appears flying in front of everyone then threw the sword and the key to Kawamatsu<br><br>\\- Kawamatsu free himself<br><br>\\- Even while Kawamatsu opening the cuffs he was in silhouette with his sword<br><br>\\- Then he killed 4 of Queen's subordinates<br><br>\\- Raizou and Kiku going to Kawamatsu while they smiling<br><br>\\- Kiku keeps the prisoners away from Luffy<br><br>\\- Raizou and Kiku recognize Hyo<br><br>\\- Last page they are in a wonderful panel<br><br>&#x200B;<br><br>**Raw Pics:**<br><br>[***Kawamatsu Reveal***](https://i.imgur.com/2l7Ww73.jpg)<br><br>Translation: \"Retainer of the Kouzuki Clan Kawamatsu the Yokozuna.<br><br>Kawamatsu: Kawamatsu the Kappa!!! Will now join the battle!!!\"<br><br>[***Last page (Kiku transformed into a demon?)***](https://i.imgur.com/hTVKY0d.jpg)<br><br>Translation: \"Raizou: True, we are just the ghosts!!!<br><br>Chopper:Huh?!! You’re a man?!<br><br>Okiku: I’m a girl at heart.<br><br>Chopper(?): Your face is scary!!<br><br>Beasts Pirates: He’s the rival ninja of Fukurokuju, “Raizou of the Mist”!!<br><br>Beasts Pirates: Then who’s Luffytarou?!!<br><br>Babanuki: This is like those jokes lord Orochi brought up. I have to report this to Kaido-san somehow!!!<br><br>Okiku: No......now that you’ve seen it, I would have to close your mouth\"<br><br>[***Kiku***](https://i.imgur.com/ZafaQQZ.jpg)<br><br>[***The Group standing badass***](https://i.imgur.com/fypg162.jpg)<br><br>[***Kawamatsu funny panel and Old Maid***](https://i.imgur.com/p20FdN5.jpg)<br><br>[***Kawamatsu Fighting 1***](https://i.imgur.com/jbVPbt8.jpg)<br><br>[***Kawamatsu Fighting 2***](https://i.imgur.com/8DDnCRs.jpg)<br><br>Translation: \"Beasts Pirates: Ah!!<br><br>Kawamatsu: You made it in time......Raizou......<br><br>It’s been a while, my favorite sword “Sotomusou”!<br><br>You guys......do you like Sumo?\"<br><br>[***First Page***](https://i.imgur.com/9zy3R8B.jpg)"}}