{"c60s9e": {"id": "c60s9e", "user": "Prmas", "created_on": "2019-06-27@14:06:38", "title": "One Piece Chapter 947 SPOILERS", "body": "Source: @EtenBoby<br><br>**Chapter Title:** Queen’s bet<br><br>**Info:**<br><br>\\- Luffy used the technique that was definitely used that Rayleigh back then, but he was so desperate during the process he couldn’t remember how exactly he was able to do it. <br><br>But what he just used surpasses the Ryuo that Grandpa Hyo was trying to taught him, if he could completely master it he’ll be able to save themselves from Big Mom’s punch.<br><br>\\- Luffy and Grandpa Hyo were blown away when they try it for the second time and failed, Grandpa Hyo is fine because he was guarding with Ryuo. <br><br>\\- Ryuo, or Haki, is an invisible armor that you can use for both defense and offense, but if you take it a stage farther, the Haki will become a power so great that it can reach the interior of the opponent’s body and destroy them from within.<br><br>\\- Even though Luffy destroyed the collars from within unconsciously, but it’s good enough, after saying that Grandpa Hyo fall to the ground...While chasing Luffy, Big Mom destroys the mine and head towards the melting furnace. If Queen couldn’t stop her, of course the others wouldn’t be able to as well.<br><br>\\- After regaining his consciousness, Queen has an idea and give out orders to his subordinates. If you head in a straight direction in Udon, you would definitely ended up coming back, when Big Mom actually came back,Queen uses oshiruko as a bait and attack her with Brachio Bombs which exploded on her head.<br><br>\\- The impact help her regains her memories, and became very energetic. Queen and the others thought they were doomed but she fall asleep. <br><br>\\- Taking this opportunity, Queen orders to tie her up with 100% pure seastone chain, which they wrap around her body 100 times, then injects her with 100% animal anesthesia. Aside from the minimum amount of guards, all of them needs to get on a boat and escort Big Mom to Onigashima before she wakes up. <br><br>\\- After Queen and his subordinates left, Babanuki is in charge of Udon. Udon is completely cut off from the rest of the world because of the snail situation. Luffy starts rampaging since there’s no more opponents."}, "ceomqj": {"id": "ceomqj", "user": "Prmas", "created_on": "2019-07-18@16:06:06", "title": "One Piece Chapter 949 SPOILERS", "body": "**Sources:** @Redon, @hiktoj, @Etenboby<br><br>**Chapter Title: Zombie**<br><br>**Cover Page: It's about straw hats inside swimming pool with a large gorilla.**<br><br>**Full Description:**<br><br>\\- In order to stop Luffy and the others, the guards start shooting the Plague rounds made from viruses.<br><br>\\- Their target is not Luffy and his group, but all the prisoners.<br><br>\\- If you got hit you’ll get a infectious disease and feel burning pain until you die.<br><br>\\- It’s a weapon created by Queen, its name is Zombie.<br><br>\\- The guards command the infected prisoners to get close to Luffy’s group, they use them like biochemical weapon.<br><br>\\- The prisoners protest in pain: We wouldn’t be like this if you outsiders didn’t appear, it’s impossible for you guys to take down Kaidou, get out!<br><br>\\- Upon hearing this, Luffy touches them and yell: this kind of thing have no effect at all!<br><br>\\- He continues: I promised Otama that I’ll save this country, to let everyone eat to their hearts content, we are here to defeat Kaidou! There’s no reason for us to get stopped by our comrades, you guys decide whether you want to follow Kaidou or follow us!<br><br>\\- The prisoners were all moved by Luffy’s speech.<br><br>\\- Babanuki saw that this is not going well for them and decided to take advantage of them talking and hurl a large amount of Plague rounds at them.<br><br>\\- But it was put to a stop immediately by Luffy, who said because he saw a dangerous future.<br><br>\\- Then he turns to the prisoners: now, it’s up to you guys!<br><br>\\- 8 days till the final battle—successfully dominated Udon without being noticed by the enemy headquarter.<br><br>&#x200B;<br><br>**Pics:**<br><br>[*Shonen Jump Magazine Cover*](https://pbs.twimg.com/media/D_u2KLaWsAAPCh2?format=jpg&name=small)<br><br>[*Luffy getting poisoned*](https://pbs.twimg.com/media/D_vsfiYX4AYD6fZ?format=jpg&name=small)<br><br>[*Babanuki (Elephant Jailer) gets exploded*](https://pbs.twimg.com/media/D_v1rVJWwAETVVt?format=jpg&name=small)"}, "c8xq79": {"id": "c8xq79", "user": "Prmas", "created_on": "2019-07-04@13:42:49", "title": "One Piece Chapter 948 SPOILERS", "body": "Source: @Etenboby and @sil5r<br><br>**Chapter Title: Introducing Kawamatsu the Kappa**<br><br>**New cover story: “The Fire Tank Pirates that had successfully escaped”**<br><br>**Info:**<br><br>To make sure things doesn’t get out of control, the prisoners stop Luffy.<br><br>In order to give the prisoners hope and to get them out of Luffy’s way, Kawamatsu receives the key and someone’s favorite sword and break out.<br><br>Okiku and Raizou has revealed their identities, and they sees that Grandpa Hyo really is Hyogoro.<br><br>Okiku is going to stop them from reporting to Kaido.<br><br>&#x200B;<br><br>***Break next week***<br><br>(The Info will get updated)<br><br>&#x200B;<br><br>**Additional Info:**<br><br>\\- Kiku's epithet is Remaining Snow.<br><br>\\- This chapter consists of 17 pages.<br><br>\\- A new kind of sword appears in the chapter. It's called **Love Sword** (愛刀) or something like that.<br><br>\\- Kawamatsu used to be the strongest Sumo wrestler. As wolfwood mentioned, Kawamatsu's first name Yokozuna is given to strongest Sumo wrestler.<br><br>\\- His sword is called Soto-musou (Sumo technique)<br><br>\\- Luffy is still fighting Queen's subordinates with Ryuo and Hyo watching him<br><br>\\- The prisoners trying to chain Luffy after Queen's subordinates arrange themselves and the leaders of the prison intervene to stop them<br><br>\\- When the prisoners trying to stop Luffy it's a comedy panel<br><br>\\- Queen's subordinates trying to enter Kawamatsu jail<br><br>\\- While Kawamastsu is inside his shadow appears (silhouette)<br><br>\\- Out of sudden Raizou appears flying in front of everyone then threw the sword and the key to Kawamatsu<br><br>\\- Kawamatsu free himself<br><br>\\- Even while Kawamatsu opening the cuffs he was in silhouette with his sword<br><br>\\- Then he killed 4 of Queen's subordinates<br><br>\\- Raizou and Kiku going to Kawamatsu while they smiling<br><br>\\- Kiku keeps the prisoners away from Luffy<br><br>\\- Raizou and Kiku recognize Hyo<br><br>\\- Last page they are in a wonderful panel<br><br>&#x200B;<br><br>**Raw Pics:**<br><br>[***Kawamatsu Reveal***](https://i.imgur.com/2l7Ww73.jpg)<br><br>Translation: \"Retainer of the Kouzuki Clan Kawamatsu the Yokozuna.<br><br>Kawamatsu: Kawamatsu the Kappa!!! Will now join the battle!!!\"<br><br>[***Last page (Kiku transformed into a demon?)***](https://i.imgur.com/hTVKY0d.jpg)<br><br>Translation: \"Raizou: True, we are just the ghosts!!!<br><br>Chopper:Huh?!! You’re a man?!<br><br>Okiku: I’m a girl at heart.<br><br>Chopper(?): Your face is scary!!<br><br>Beasts Pirates: He’s the rival ninja of Fukurokuju, “Raizou of the Mist”!!<br><br>Beasts Pirates: Then who’s Luffytarou?!!<br><br>Babanuki: This is like those jokes lord Orochi brought up. I have to report this to Kaido-san somehow!!!<br><br>Okiku: No......now that you’ve seen it, I would have to close your mouth\"<br><br>[***Kiku***](https://i.imgur.com/ZafaQQZ.jpg)<br><br>[***The Group standing badass***](https://i.imgur.com/fypg162.jpg)<br><br>[***Kawamatsu funny panel and Old Maid***](https://i.imgur.com/p20FdN5.jpg)<br><br>[***Kawamatsu Fighting 1***](https://i.imgur.com/jbVPbt8.jpg)<br><br>[***Kawamatsu Fighting 2***](https://i.imgur.com/8DDnCRs.jpg)<br><br>Translation: \"Beasts Pirates: Ah!!<br><br>Kawamatsu: You made it in time......Raizou......<br><br>It’s been a while, my favorite sword “Sotomusou”!<br><br>You guys......do you like Sumo?\"<br><br>[***First Page***](https://i.imgur.com/9zy3R8B.jpg)"}}