{
    "c60s9e": {
        "id": "c60s9e",
        "user": "Prmas",
        "created_on": "2019-06-27@14:06:38",
        "title": "One Piece Chapter 947 SPOILERS",
        "body": "Source: @EtenBoby<br><br>**Chapter Title:** Queen’s bet<br><br>**Info:**<br><br>\\- Luffy used the technique that was definitely used that Rayleigh back then, but he was so desperate during the process he couldn’t remember how exactly he was able to do it. <br><br>But what he just used surpasses the Ryuo that Grandpa Hyo was trying to taught him, if he could completely master it he’ll be able to save themselves from Big Mom’s punch.<br><br>\\- Luffy and Grandpa Hyo were blown away when they try it for the second time and failed, Grandpa Hyo is fine because he was guarding with Ryuo. <br><br>\\- Ryuo, or Haki, is an invisible armor that you can use for both defense and offense, but if you take it a stage farther, the Haki will become a power so great that it can reach the interior of the opponent’s body and destroy them from within.<br><br>\\- Even though Luffy destroyed the collars from within unconsciously, but it’s good enough, after saying that Grandpa Hyo fall to the ground...While chasing Luffy, Big Mom destroys the mine and head towards the melting furnace. If Queen couldn’t stop her, of course the others wouldn’t be able to as well.<br><br>\\- After regaining his consciousness, Queen has an idea and give out orders to his subordinates. If you head in a straight direction in Udon, you would definitely ended up coming back, when Big Mom actually came back,Queen uses oshiruko as a bait and attack her with Brachio Bombs which exploded on her head.<br><br>\\- The impact help her regains her memories, and became very energetic. Queen and the others thought they were doomed but she fall asleep. <br><br>\\- Taking this opportunity, Queen orders to tie her up with 100% pure seastone chain, which they wrap around her body 100 times, then injects her with 100% animal anesthesia. Aside from the minimum amount of guards, all of them needs to get on a boat and escort Big Mom to Onigashima before she wakes up. <br><br>\\- After Queen and his subordinates left, Babanuki is in charge of Udon. Udon is completely cut off from the rest of the world because of the snail situation. Luffy starts rampaging since there’s no more opponents."
    },
    "ceomqj": {
        "id": "ceomqj",
        "user": "Prmas",
        "created_on": "2019-07-18@16:06:06",
        "title": "One Piece Chapter 949 SPOILERS",
        "body": "**Sources:** @Redon, @hiktoj, @Etenboby<br><br>**Chapter Title: Zombie**<br><br>**Cover Page: It's about straw hats inside swimming pool with a large gorilla.**<br><br>**Full Description:**<br><br>\\- In order to stop Luffy and the others, the guards start shooting the Plague rounds made from viruses.<br><br>\\- Their target is not Luffy and his group, but all the prisoners.<br><br>\\- If you got hit you’ll get a infectious disease and feel burning pain until you die.<br><br>\\- It’s a weapon created by Queen, its name is Zombie.<br><br>\\- The guards command the infected prisoners to get close to Luffy’s group, they use them like biochemical weapon.<br><br>\\- The prisoners protest in pain: We wouldn’t be like this if you outsiders didn’t appear, it’s impossible for you guys to take down Kaidou, get out!<br><br>\\- Upon hearing this, Luffy touches them and yell: this kind of thing have no effect at all!<br><br>\\- He continues: I promised Otama that I’ll save this country, to let everyone eat to their hearts content, we are here to defeat Kaidou! There’s no reason for us to get stopped by our comrades, you guys decide whether you want to follow Kaidou or follow us!<br><br>\\- The prisoners were all moved by Luffy’s speech.<br><br>\\- Babanuki saw that this is not going well for them and decided to take advantage of them talking and hurl a large amount of Plague rounds at them.<br><br>\\- But it was put to a stop immediately by Luffy, who said because he saw a dangerous future.<br><br>\\- Then he turns to the prisoners: now, it’s up to you guys!<br><br>\\- 8 days till the final battle—successfully dominated Udon without being noticed by the enemy headquarter.<br><br>&#x200B;<br><br>**Pics:**<br><br>[*Shonen Jump Magazine Cover*](https://pbs.twimg.com/media/D_u2KLaWsAAPCh2?format=jpg&name=small)<br><br>[*Luffy getting poisoned*](https://pbs.twimg.com/media/D_vsfiYX4AYD6fZ?format=jpg&name=small)<br><br>[*Babanuki (Elephant Jailer) gets exploded*](https://pbs.twimg.com/media/D_v1rVJWwAETVVt?format=jpg&name=small)"
    },
    "c8xq79": {
        "id": "c8xq79",
        "user": "Prmas",
        "created_on": "2019-07-04@13:42:49",
        "title": "One Piece Chapter 948 SPOILERS",
        "body": "Source: @Etenboby and @sil5r<br><br>**Chapter Title: Introducing Kawamatsu the Kappa**<br><br>**New cover story: “The Fire Tank Pirates that had successfully escaped”**<br><br>**Info:**<br><br>To make sure things doesn’t get out of control, the prisoners stop Luffy.<br><br>In order to give the prisoners hope and to get them out of Luffy’s way, Kawamatsu receives the key and someone’s favorite sword and break out.<br><br>Okiku and Raizou has revealed their identities, and they sees that Grandpa Hyo really is Hyogoro.<br><br>Okiku is going to stop them from reporting to Kaido.<br><br>&#x200B;<br><br>***Break next week***<br><br>(The Info will get updated)<br><br>&#x200B;<br><br>**Additional Info:**<br><br>\\- Kiku's epithet is Remaining Snow.<br><br>\\- This chapter consists of 17 pages.<br><br>\\- A new kind of sword appears in the chapter. It's called **Love Sword** (愛刀) or something like that.<br><br>\\- Kawamatsu used to be the strongest Sumo wrestler. As wolfwood mentioned, Kawamatsu's first name Yokozuna is given to strongest Sumo wrestler.<br><br>\\- His sword is called Soto-musou (Sumo technique)<br><br>\\- Luffy is still fighting Queen's subordinates with Ryuo and Hyo watching him<br><br>\\- The prisoners trying to chain Luffy after Queen's subordinates arrange themselves and the leaders of the prison intervene to stop them<br><br>\\- When the prisoners trying to stop Luffy it's a comedy panel<br><br>\\- Queen's subordinates trying to enter Kawamatsu jail<br><br>\\- While Kawamastsu is inside his shadow appears (silhouette)<br><br>\\- Out of sudden Raizou appears flying in front of everyone then threw the sword and the key to Kawamatsu<br><br>\\- Kawamatsu free himself<br><br>\\- Even while Kawamatsu opening the cuffs he was in silhouette with his sword<br><br>\\- Then he killed 4 of Queen's subordinates<br><br>\\- Raizou and Kiku going to Kawamatsu while they smiling<br><br>\\- Kiku keeps the prisoners away from Luffy<br><br>\\- Raizou and Kiku recognize Hyo<br><br>\\- Last page they are in a wonderful panel<br><br>&#x200B;<br><br>**Raw Pics:**<br><br>[***Kawamatsu Reveal***](https://i.imgur.com/2l7Ww73.jpg)<br><br>Translation: \"Retainer of the Kouzuki Clan Kawamatsu the Yokozuna.<br><br>Kawamatsu: Kawamatsu the Kappa!!! Will now join the battle!!!\"<br><br>[***Last page (Kiku transformed into a demon?)***](https://i.imgur.com/hTVKY0d.jpg)<br><br>Translation: \"Raizou: True, we are just the ghosts!!!<br><br>Chopper:Huh?!! You’re a man?!<br><br>Okiku: I’m a girl at heart.<br><br>Chopper(?): Your face is scary!!<br><br>Beasts Pirates: He’s the rival ninja of Fukurokuju, “Raizou of the Mist”!!<br><br>Beasts Pirates: Then who’s Luffytarou?!!<br><br>Babanuki: This is like those jokes lord Orochi brought up. I have to report this to Kaido-san somehow!!!<br><br>Okiku: No......now that you’ve seen it, I would have to close your mouth\"<br><br>[***Kiku***](https://i.imgur.com/ZafaQQZ.jpg)<br><br>[***The Group standing badass***](https://i.imgur.com/fypg162.jpg)<br><br>[***Kawamatsu funny panel and Old Maid***](https://i.imgur.com/p20FdN5.jpg)<br><br>[***Kawamatsu Fighting 1***](https://i.imgur.com/jbVPbt8.jpg)<br><br>[***Kawamatsu Fighting 2***](https://i.imgur.com/8DDnCRs.jpg)<br><br>Translation: \"Beasts Pirates: Ah!!<br><br>Kawamatsu: You made it in time......Raizou......<br><br>It’s been a while, my favorite sword “Sotomusou”!<br><br>You guys......do you like Sumo?\"<br><br>[***First Page***](https://i.imgur.com/9zy3R8B.jpg)"
    },
    "chih65": {
        "id": "chih65",
        "user": "brikskohuh",
        "created_on": "2019-07-25@13:39:55",
        "title": "One Piece 950 Spoilers",
        "body": "One Piece Chapter 950: \" The dreams of the soldiers\"<br><br>&#x200B;<br><br>Cover: Chiffon wants to see Lola again<br><br>&#x200B;<br><br>***In*** ***Udon Prison***<br><br>&#x200B;<br><br>Luffy invites Kid to fight together, but Kid had enough about this alliance thing and rejects him.<br><br>Kid aims to take back all of his crewmates, and he brings Killer with him.<br><br>After learning that Luffy’s a pirate, the prisoners begin to have doubts.<br><br>They are also skeptical about the Red Scabbards coming from the past.<br><br>But they accept all of this after seeing that Momo is safe.<br><br>&#x200B;<br><br>***In Kuri***<br><br>&#x200B;<br><br>Shutenmaru told Kin’emon that they didn’t believe that Kin’emon and the others will return after 20 years.<br><br>So 10 years ago, they couldn’t wait any longer and attacked Onigashima, after showing Kin’emon the graves of those who died in that rebellion, they decided to attack Onigashima 8 days later with those who’re ready.<br><br>Deep inside the forest, Zoro managed to defeat the Ninja squad.<br><br>He decide that he’ll take back Shusui before the final battle, and ask Hiyori to bring him to the Bandit’s bridge in Ringo.<br><br>Zoro hint that he wants to take down Orochi in order to avenge Tonoyasu.<br><br>But Hiyori reveals that she wants to kill Orochi with her own hands.<br><br>&#x200B;<br><br>***In the Flower Capital***<br><br>&#x200B;<br><br>Hawkins has captured Law, and they told him to spill all of their plans, to which Law answers with a fearless smile.<br><br>&#x200B;<br><br>Chapter End<br><br>&#x200B;<br><br>More info from Redon<br><br>>Do you remember \"**Sunach**\" shout that Zoro taught Momonosuke? This chapter reveals that in Kuri \"Sunach\" means \"*Abandon the name and the wisdom*\".  <br>>  <br>>Ashura himself didn't fight in the battle 10 years ago, in fact he said his farewell crying to the soldiers that departed to Onigashima.<br><br>&#x200B;<br><br>[Spoiler Image 01 : Kid refuses Luffy's invitation to fight along with him](https://i.imgur.com/Z4Ekdns.jpg)<br><br>[Spoiler Image 02 : Momo and the prisoners](https://i.imgur.com/nSEBlxQ.jpg)<br><br>[Spoiler Image 03 : Law's fearless smile](https://i.imgur.com/0KzcZVm.jpg)<br><br>[Spoiler Image 04 : A mummy looking Luffy](https://imgur.com/7DiCGhv.jpg)<br><br>[Spoiler Image 05 : Shutenmaru's flashback?](https://imgur.com/KtF2xsG.jpg)<br><br>[Spoiler Image 06 : Zoro slices up the Ninja](https://imgur.com/yROXfkx.jpg)<br><br>[Spoiler Image 07 : Eustass Kid got his metal arm back](https://imgur.com/tAG9fon.jpg)<br><br>&#x200B;<br><br>Here are the Chinese scans if anyone is interested [http://www.hanhuazu.cc/comics/detail/11518](http://www.hanhuazu.cc/comics/detail/11518)<br><br>&#x200B;<br><br>Source : EtenBoby @OroJackson"
    },
    "ckl4lb": {
        "id": "ckl4lb",
        "user": "brikskohuh",
        "created_on": "2019-08-01@17:29:14",
        "title": "One Piece 951 Spoilers",
        "body": "One Piece Chapter 951 Title : \" Rampage \"<br><br>&#x200B;<br><br>[One Piece color spread Stampede dinner](https://imgur.com/H9Xshlx.jpg)<br><br>&#x200B;<br><br>***Flower Capital—***<br><br>Orochi is furious that they didn’t capture any of the Strawhats.<br><br>In order to capture the criminals, they increase the level of security in the Capital<br><br>Orochi’s men starts putting up wanted posters.<br><br>Sanji and Shinobu are discussing the current situation on the rooftop.<br><br>&#x200B;<br><br>***North of Ebisu Town—***<br><br>Nami is having a conversation with Bepo’s group who have escaped.<br><br>Bepo hands her a paper with the new secret code on it that’s been distributed in the cell, looks like there’re some changes.<br><br>Nami believes that she should inform Kin’emon immediately about this.<br><br>Bepo’s group begin to have a flashback on Hawkins releasing them—<br><br>Hawkins escorted Law to the cell by himself, it seems that they have made a deal with each other, or received some form of threats, Hawkins destroyed the three straw avatars of them in front of Law, and released them.<br><br>Law said to them that they can’t let the Strawhats know that he’s captured.<br><br>&#x200B;<br><br>***Between the Flower Capital and Kuri—***<br><br>Orochi’s men are checking with posters in hands.<br><br>Robin and Usopp passed with their “ha?” faces.<br><br>Ashura brings them to an abandoned port in the southwest, and shows them a large ship which they can put 1000 soldiers on.<br><br>&#x200B;<br><br>***Onigashima—***<br><br>Big Mom arrives at Onigashima, she’s been eating sweets nonstop.<br><br>The Calamities are there as well.<br><br>She orders Kaidou’s men to take off her handcuffs, that’s when Kaidou arrives.<br><br>Her handcuffs fall to the ground and pick up Napoleon, they clash with each other!<br><br>&#x200B;<br><br>More detailed about the Kaido and Big Mom clash from @VegaPank<br><br>>The clash between Big Mom and Kaido made the weather changed and the sky cracked. The haki effects appeared above Onigashima island<br><br>&#x200B;<br><br>More information from Redon<br><br>>There are 3 races that Big Mom hasn't in her family yet. King is from one of these races, but there's no more information about them in the chapter.<br><br>&#x200B;<br><br>According to Big Mom's dialogue to King, she says<br><br>>There’re actually “3 species” that I still don’t have in my country, one may have disappeared from history, but **you’re** alive, join us!!!<br><br>&#x200B;<br><br>**Chapter End**<br><br>Note : Break next week. (It's Shonen jump's break, not Oda's)<br><br>&#x200B;<br><br>[Spoiler Image 01 : Big mom and Kaido clash](https://i.imgur.com/Ka2Z73R.jpg)<br><br>[Spoiler Image 02 : The Strawhats and Heart Pirates Wano posters](https://i.imgur.com/ebFnPS4.jpg)<br><br>[Spoiler Image 03 : Brook, Robin and Ussop \"Ha\" faces](https://i.imgur.com/Duqql7c.jpg)<br><br>[Spoiler Image 04 : King and Big Mom interaction](https://i.imgur.com/FgDaBil.jpg)<br><br>[Spoiler Image 05 : Kaido and Big Mom's clash made the sky splits in half](https://i.imgur.com/kGqig66.jpg)<br><br>[Spoiler Image 06 : Law lets himself captured by Hawkins to save his crew](https://imgur.com/L6YdmjU.jpg)<br><br>[Spoiler Image 07 : Kaido orders his men to remove Big mom's cuffs, as per her request](https://imgur.com/fp54xkH.jpg)<br><br>[Spoiler Image 08 : The samurais and ninjas of Mimawarigumi](https://imgur.com/6sR9NzI.jpg)<br><br>[Spoiler Image 09 : Orochi and Fukurokunoju]( https://imgur.com/xH9WPJS.jpg ) Thanks to u/OharaLibrarianArtur for the image, apparently he has the Japanese scans in his hands.<br><br>&#x200B;<br><br>Source : Shuhui, translated by u/EtenBoby @OroJackson"
    },
    "d6zxo7": {
        "id": "d6zxo7",
        "user": "CaptainBeckmann",
        "created_on": "2019-09-21@04:34:19",
        "title": "One piece chapter 956 SPOILER",
        "body": "I'm confused. Did Morgans make a fake headline about sabo? What happened to alabasta kingdom at the reverie? Who died? Could somebody please help me understand cuz I'm superrrr confused.<br><br>Edit: Changed the first question a bit to make it clearer."
    },
    "d71x3a": {
        "id": "d71x3a",
        "user": "Ginopastino90",
        "created_on": "2019-09-21@07:08:14",
        "title": "[Chapter 956 Spoilers] Contemporary One Piece Geopolitics",
        "body": "Chapter 956 depicts a One Piece world practically at the verge of its version of a World War. <br><br>As Law predicted, the departure of Doflamingo, the Joker, the Main Broker tying all the strings of the Underworld and the Three Great Powers, has created a crippling event for all parties.<br><br>1) Kaido has lost his supply of devil fruit soldiers, and, seeking an alternative source of brutal military force, he has teamed up with long-aquaitance Big Mom, who he has known since a time where they were both part of Pre-Roger Era's unrivaled Pirate Crew — The Rox. Yonkos are no longer power balanced.<br><br>2) Shichibukais have been abolished. Coby, now promoted to the Rank of Rear-Admiral, together with Drake, the Supernova, are introduced as a member of \"Sword\", a secret force that coordinates undercover intelligence gathering with on behalf of the Marines (Rosinante and Sengoku were probably at least involved with it, at the time Drake infiltrated the Barrel Pirates, who had found the Ope Ope no Mi). Coby is now deployed to capture Boa Hancock. He joins a full world-scale deployment of Marine personnel that is hunting the Warlords. Marineford only briefly overviewed the physical scale of Warlords, this is now explored further — Coby says they have no more forces to deal with anything else. Marines vs. Shichibukai is the first really opening battlefront. This conflict will weaken them towards Kaido & Big Mom's might.<br><br>2a) Sabo, who is likely still alive, and by extension, has probably been framed for a crime against the Nefertari Family — probably Vivi. <br><br>At the same time King Cobra, requesting an audience to the Gorosei, has been likely asking questions about the Void Century, Pluton and the role of The Poneglyphs — The 5 Elders have clearly showed their intention to silence him.<br><br>Im-sama, the true Highest Authority of the One Piece World, has likely indicated Vivi as the next light to extinguish. She's young, activist, even if exiled, a tenryuubito, the depositary of the country hiding Pluton and poses the greatest future political threat at the Reveries vs. her weakening father.<br><br>I speculate Sabo found out about this while infiltrating Marijoa, and managed to save her, fighting the Admirals in the process — the Big News are a cover up. Marines are secretly hunting him. Sabo and Revo Commanders vs. Marines.<br><br>Blackbeard, a true mastermind a D., a men of desires, sees through the event and decides to take advantage of the weakened parties to take \"that\" — the Mera Mera no Mi he is obsessioned to since Dressrosa. Revolutionaries, protecting Sabo, will exact their retaliation for Baltigo's incident. Revolutionaries vs. Blackbeard, a Yonko, vs. Marines. The second front opens.<br><br>3) The World Government, through the CP-0 handles its largest weapon contractor in Wano Country, and this is none but Kaido.<br><br>Surrounding the Straw Hats is slowly, but steadily, gathering a simply astronomical amount of forces. <br><br>At least 4200 Wano Samurai, and between them The 9 Red Scabbards, whose notable members have been shown to be able to hold their own against Shichibukai level-opponents (Kinemon can cut explosions and his torso could rival with Law's swordmanship in Punk Hazard) and Yonko-Commanders (Ashura has been shown to effortlessly slash Jack).<br><br>The Minks, whose warriors could rival with an entire dispatch of the Beast Pirates, will turn Sulong at their Fire Festival — their two leaders, Nekomamushi and Inuarashi are Yonko-Commander level. With them, there is a concrete chance Marco The Phoenix and the remnants of the Whitebeard Pirate will also show up.<br><br>Jinbei, a former Shichibukai and someone who could briefly push back a weakened Big Mom, the Sun Pirates, Trafalgar D. Water Law and the Heart Pirates. <br><br>Conqueror's Haki wielder and Luffy's rival — Captain Kidd, Killer has the remnants of the Kidd Pirates.<br><br>The Straw Hats Grand Fleet, 5600 men strong and with powerful captains.<br><br>Luffy and Zoro, fresh with strong power ups.<br><br>Although I can't still see Big Mom & Kaido's Allience falling, Luffy will undoubtedly strike a massive hit on them.<br><br>The Supernova are all mostly involved here.<br><br>It will eventually be a significant part of the 2nd tier world pirates' entire might vs. the Two Yonkos.<br><br>THE WILDCARDS<br><br>\"ROX\" — Anticipation towards the old era's mightiest pirate has been slowly been building up. What better moment than the world turning upside down, to surface from the shadows of legend?<br><br>One Piece World is clearly a colorful, yet faithful representation of the world we live in and broad-strokes all its main characteristics — political corruption, media manipulation, threats to democracy, social, ethnical, ideological and religion issues. Misery. Slavery. <br><br>Wouldn't One Piece be incomplete without a sci-fi twist? Germa 66, Vegapunk, Pacifista Cyborgs with DF-based capabilities, WG'S next superweapon, Artificial DF, Genetic experiments for Gigantification, the long fanbase forgotten Space Pirates, and finally the strong symbolism of the Moon as a celestial object, origin to the Birkan Civilization and full with ancient technological mysteries. hints to this being a genuine component of One Piece are all over the story.<br><br>Aliens. Sure, ALIENS ARE MISSING! What's the wildest speculation?!<br><br>The night of the Fire Festival, a Full Moon Night, Enel, One Piece's representation of Raijin, the God of Thunder will invade the Blue Sea at Wano.<br><br>Doflamingo, witnessing the events, howls from the depths of Impel Down with the foulest of laughters.<br><br>The Throne War has begun."
    },
    "d8zrqa": {
        "id": "d8zrqa",
        "user": "notinthisworld8",
        "created_on": "2019-09-25@16:08:20",
        "title": "One Piece Chapter 957 - SPOILERS!",
        "body": "<br><br>One Piece Chapter 957 Title \"Ultimate\" <br><br>- These Spoilers are confirmed by Redon<br><br>SPOILERS: <br><br>-  ACT 3 won't start in this week's chapter.<br>All the Yonkous bounty are revealed and it's shown that Blackbeard has the lowest bounty out of all the Yonkous.<br>- Rogers's old Bounty is revealed.<br>- We get Info about the Rox<br>- No break next week.<br>- This is the most hype chapter IN THE ENTIRE SERIES<br><br>From Redon<br><br>More information.<br><br>- Shirohige, Big Mom and Kaido was in Rox ship.<br>- Rox was a D.<br>- Shiki was part of Rox as well.<br>- Garp and Gol D. Roger joined to defeat Rox.<br>- All wanted.<br>- More spoilers:<br>- The three pirate kaido, bigmom and whitebeard, their name in the rocks was Thunder's big three<br><br>Shanks: 4,000,000,000 de Berries.<br>Big Mom: 4,300,000,000 de Berries.<br>Kaido: 4,600,000,000 de Berries.<br>Whitebeard: 5,000,000,000 de Berries.<br>Gol D Roger: 5,500,000,000 de Berries.<br><br>From Redon<br><br>Vegapunk, Ryokugyu, Bonney and Kuma information is FAKE.<br><br>For now, only first post's information it's true<br><br>- [UPDATE] Here is a small summary from 5ch. <br>Information about Rox and D.<br>God Valley incident (alliance between Marine and pirates)<br>The reason why Garp didn't promote to Admiral<br>Oden and Wano<br>Bounties (already mentioned by Redon.<br><br>Spoiler pics: <br><br>- Fujitora and Akainu ( Fujitora injured slightly) <br>https://pbs.twimg.com/media/EFX458nWkAA7ndR?format=jpg&name=medium<br><br>Translation for this panel: <br><br>- Sakazuki/Issho Panel<br><br>Sakazuki: You’ve always wanted this right Issho? The annulment of the Shichibukai is as a result of y’all’s pessimism and although I objected to it, I won’t trample on the decision the Kings have made.<br><br>Fuji: The necessary sacrifice to allow the Shichibukai to continue to exist?!...Sakazuki, you’ve never been one of them so I don’t expect you to understand.<br><br>Sakazuki: ...<br><br>Fuji: All that’s left now, is to believe in the SSG. I’m sure the power/influence structure of the world will change drastically.<br><br>Chapter summary, thanks to Etenboby:<br><br>Sengoku: Kaido and Big Mom, it is true that they used to be on the same ship, however, their current strength is on a whole different level than it is 38 years ago. If the information on their “alliance” is true, then the worst pirate crew in the world is about to be borne.<br><br>Brannew!! What are the current bounties of those two?<br><br>Brannew: Oh yes, we are working on the new bounties of those who have been stripped of their Warlord position.<br><br>Let’s review all of their bounties.<br><br>—First, we have “Blackbeard”, whom people started to call an Emperor about a year ago. He obtained strong subordinates during the attack on Impel Down 2 years ago. Right now he’s the “ruler” of Pirate Island Beehive. He’s the new power that replaced Whitebeard, and he’s still growing.<br>The admiral of “Blackbeard Pirates”, Marshall “D” Teach!! Bounty: 2.2476 billion berries!!!<br><br>—Next, we have him who’s been call an Emperor for 6 years, the youngest of the four and he’s trusted by his subordinates.<br>Beckman, Roo, and Yasopp...his commanders make a name for themselves one after another. Known for having a high average bounty among the members, the crew with the best balance, a impregnable crew.<br>The leader of “RedHair Pirates”, “RedHair Shanks”!!! Bounty: 4.0489 billion berries!!!<br><br>Next, it is said that she attacked a village of Elbaf when she’s just a child. A natural born monster!! She is a dictator queen who doesn’t believe anything other than bloodline, and created a bizarre country known as “Totto Land” with her 85 children.<br>Captain of “Big Mom Pirates”, Charlotte LinLin!!!<br>Bounty: 4.388 billion berries!!!<br><br>And—even though he was just a “pirate apprentice” at the “Rocks Pirates”.........later his personal strength attracts the respect of groups of brutal pirates, to the point of being call an Emperor.<br>The General of “Beasts Pirates”, “Kaido of the Beasts”. Bounty: 4.6111 billion berries!!!<br>From now on, we’ll not be able to use the “Warlords” against the “Four Emperors”!! Whether the choice of omitting those poisonous ones is correct or not, is depended on the future work of SSG, the special science corp of Marine.<br><br>—By the way we’ll also review the bounties of those legenardy men.<br>Captain of “Whitebeard Pirates”, Edward Newgate!! Bounty: 5 billion berries!!!<br><br>Captain of “Roger Pirates”, the “Pirate King” Gold Roger, bounty: 5.5 billion berries!!!<br><br>From Shuhui:<br><br>- According to news reports, in the God Valley incident 38 years ago, the Rocks Pirates was destroyed by Marine Vice Admiral Garp.<br>Which is why he’s called the “Hero of Marine”, though he himself doesn’t like that title.<br>What really happened was: in order to protect the Celestial Dragons and their slaves, Garp and Roger worked together to defeat the Rocks Pirates.One of the reasons Garp refuse to be promoted to admiral is that admirals are direct subordinates of the Celestial Dragons."
    }
}