{
    "c8xq79": {
        "id": "c8xq79",
        "user": "Prmas",
        "created_on": "2019-07-04@13:42:49",
        "title": "One Piece Chapter 948 SPOILERS",
        "body": "Source: @Etenboby and @sil5r<br><br>**Chapter Title: Introducing Kawamatsu the Kappa**<br><br>**New cover story: “The Fire Tank Pirates that had successfully escaped”**<br><br>**Info:**<br><br>To make sure things doesn’t get out of control, the prisoners stop Luffy.<br><br>In order to give the prisoners hope and to get them out of Luffy’s way, Kawamatsu receives the key and someone’s favorite sword and break out.<br><br>Okiku and Raizou has revealed their identities, and they sees that Grandpa Hyo really is Hyogoro.<br><br>Okiku is going to stop them from reporting to Kaido.<br><br>&#x200B;<br><br>***Break next week***<br><br>(The Info will get updated)<br><br>&#x200B;<br><br>**Additional Info:**<br><br>\\- Kiku's epithet is Remaining Snow.<br><br>\\- This chapter consists of 17 pages.<br><br>\\- A new kind of sword appears in the chapter. It's called **Love Sword** (愛刀) or something like that.<br><br>\\- Kawamatsu used to be the strongest Sumo wrestler. As wolfwood mentioned, Kawamatsu's first name Yokozuna is given to strongest Sumo wrestler.<br><br>\\- His sword is called Soto-musou (Sumo technique)<br><br>\\- Luffy is still fighting Queen's subordinates with Ryuo and Hyo watching him<br><br>\\- The prisoners trying to chain Luffy after Queen's subordinates arrange themselves and the leaders of the prison intervene to stop them<br><br>\\- When the prisoners trying to stop Luffy it's a comedy panel<br><br>\\- Queen's subordinates trying to enter Kawamatsu jail<br><br>\\- While Kawamastsu is inside his shadow appears (silhouette)<br><br>\\- Out of sudden Raizou appears flying in front of everyone then threw the sword and the key to Kawamatsu<br><br>\\- Kawamatsu free himself<br><br>\\- Even while Kawamatsu opening the cuffs he was in silhouette with his sword<br><br>\\- Then he killed 4 of Queen's subordinates<br><br>\\- Raizou and Kiku going to Kawamatsu while they smiling<br><br>\\- Kiku keeps the prisoners away from Luffy<br><br>\\- Raizou and Kiku recognize Hyo<br><br>\\- Last page they are in a wonderful panel<br><br>&#x200B;<br><br>**Raw Pics:**<br><br>[***Kawamatsu Reveal***](https://i.imgur.com/2l7Ww73.jpg)<br><br>Translation: \"Retainer of the Kouzuki Clan Kawamatsu the Yokozuna.<br><br>Kawamatsu: Kawamatsu the Kappa!!! Will now join the battle!!!\"<br><br>[***Last page (Kiku transformed into a demon?)***](https://i.imgur.com/hTVKY0d.jpg)<br><br>Translation: \"Raizou: True, we are just the ghosts!!!<br><br>Chopper:Huh?!! You’re a man?!<br><br>Okiku: I’m a girl at heart.<br><br>Chopper(?): Your face is scary!!<br><br>Beasts Pirates: He’s the rival ninja of Fukurokuju, “Raizou of the Mist”!!<br><br>Beasts Pirates: Then who’s Luffytarou?!!<br><br>Babanuki: This is like those jokes lord Orochi brought up. I have to report this to Kaido-san somehow!!!<br><br>Okiku: No......now that you’ve seen it, I would have to close your mouth\"<br><br>[***Kiku***](https://i.imgur.com/ZafaQQZ.jpg)<br><br>[***The Group standing badass***](https://i.imgur.com/fypg162.jpg)<br><br>[***Kawamatsu funny panel and Old Maid***](https://i.imgur.com/p20FdN5.jpg)<br><br>[***Kawamatsu Fighting 1***](https://i.imgur.com/jbVPbt8.jpg)<br><br>[***Kawamatsu Fighting 2***](https://i.imgur.com/8DDnCRs.jpg)<br><br>Translation: \"Beasts Pirates: Ah!!<br><br>Kawamatsu: You made it in time......Raizou......<br><br>It’s been a while, my favorite sword “Sotomusou”!<br><br>You guys......do you like Sumo?\"<br><br>[***First Page***](https://i.imgur.com/9zy3R8B.jpg)"
    },
    "c2div9": {
        "id": "c2div9",
        "user": "dooperco",
        "created_on": "2019-06-19@16:24:21",
        "title": "One Piece Coloring - The Boys Are Back In Town (Chapter 943 spoilers)",
        "body": ""
    },
    "c0aeui": {
        "id": "c0aeui",
        "user": "ipagera",
        "created_on": "2019-06-14@05:44:41",
        "title": "Морска градина Бургас vs. Mорска градина Варна? Which one's best?",
        "body": "Колеги, като чистокръвен варналия, седящ си на работа, тършувайки из редит, мислейки за прекрасностите в морската градина на Варна и сладките ми спомени да пия двулитровки Каменица/Загорка на някоя пейка с приятели, се замислих дали в същия момент има някакъв бургаслия, който е в подобна ситуация. И, още по-важно - Коя морска градина е по-хубава и защо? <br><br>Моят отговор, предполагам е ясен, понеже съм biased и тн., но какво мислите, членове на r/bulgaria? <br><br>От един варналия<br><br><br>EDIT: TEST TEST TEST"
    },
    "byvvnz": {
        "id": "byvvnz",
        "user": "bibek070",
        "created_on": "2019-06-10@19:47:01",
        "title": "One Piece Chapter 946 prediction |Spoilers Ahead for Anime Watchers]",
        "body": "It's been a while since I did this, but here it goes again- let the imagination-imagination no mi run wild<br><br>&#x200B;<br><br>**CHAPTER 946 ESCAPE**<br><br>&#x200B;<br><br>**Page 1-2**<br><br>\\[*Shutenmaru takes everyone towards their current hideout. \\]*<br><br>&#x200B;<br><br>**Shutenmaru:** It's been 20 years since I last saw a man like Oden to walk on the face of Wano. 9 scabbards-pff- what a joke. We're only low life criminals to whom Oden gave a ray of hope to live a better life. But when the time came to guard our shogun, we failed miserably- and see for yourself where the country has been to.<br><br>&#x200B;<br><br>**Kinemon:** I take full responsibility as the lead--<br><br>&#x200B;<br><br>**Shutenmaru:** Shut up! You are no leader. What makes you think you're the leaders. It's not you who have been working in the shadows and looking after the nation ever since that monster and that good for nothing Orochi came  and plotted such heinous act on this land. You have no right to call yourself a leader. I will never be a part of the nine scabbards. But, I will, for Oden's sake, for Lady Toki's promise, will fight along side you and your little buddies you've brought along.<br><br>&#x200B;<br><br>**Kinemon**: *\\[bows down* \\]Thank you! It means a lot.<br><br>&#x200B;<br><br>**Shutenmaru:** However, don''t assume everyone else have the same devotion towards this nation as they did 20 years ago. Things have changed. But, if we ever are going to take down that monster and slay that bastard Orochi- there's something we will need. Follow me inside...<br><br>&#x200B;<br><br>**Page 3-4**<br><br>\\[*Kaido has been reported about Big Mom's arrival at Udon. Kaido is briefed about Queen situation.\\]*<br><br>**Kaido:** THAT GOOD FOR NOTHING KING! Inform him immediately and ask him to aid Queen right now. If he does not fixes his mess, I will personally teach these bastards what torture really is.<br><br>**Bed wetting Fodders:** Y-Yes.. K-k-kaido-sama<br><br>**Kaido:** That Old Hag, how dare she talk to me about favors. I asked none from her. That was more than 40 years ago. If it was not for ***him*** I would have slaughtered that witch long time ago.<br><br>&#x200B;<br><br>**Page 5-6-7**<br><br>*\\[Scene continues between Zoro and Kyoshiro. While Zoro pulls out few of his move set, Kyoshiro, just calmly deflects them rather easily. Kyoshiro on the other hand does not make much of an \"attacks\" on Zoro despite Zoro's relentless and barrages of air slash at kyoshiro\\]*<br><br>\\*\\*Zoro: \\[\\*\\**stands still and relaxes his swords\\]*  Why are you doing this? And why do I sense hesitation in your attacks? If you think I am some weak swordsmen, then before you make the next move, I will slice you up and behead your master straight away.<br><br>&#x200B;<br><br>\\*\\*Kyoshiro:  \\[\\*\\**Laughs \\]* How scary. I am almost crying here with fear. If you can sense hesitation in my attack then you can also sense how strong I am, don't you? I am not showing you any sympathy or doing you favors. You are waste of my time. I am a samurai- and my skills are beyond your imagination. You're just merely a criminal and a low life pirate, who pretends to wield a sword and disrespects its origin. I bet your master was some scumbag who made you believe, you can be a swordsman..what a joke.<br><br>&#x200B;<br><br>**Zoro:** How dare you speak of my master Koushiro. That's it, I will kill you if I have to in order to take that bastards head..<br><br>&#x200B;<br><br>**Kyoshiro: \\[** *did he just said Koushiro- sweats a bit \\]*<br><br>&#x200B;<br><br>**Page 8-9-10**<br><br>**Law:** How dare you take my crew captive. If any thing happens to them, I will kill you..<br><br>**Hawkins:** You can try if you want to, but you won't be able to put a scratch on me. You actions will affect your crew greatly. So, stop resisting and come along quietly, or there'll be serious consequences.<br><br>**Law:** *\\[Smiles\\]* You expect me to be cowards like you and serve under some emperor. I thought, we're from the same reckless and fearsome worst generation. I guess, facing a Yonkou has made you soft basil hawkins.<br><br>**Hawkins:**  \\*\\*\\*\\[\\*\\*\\**stares at law with anger\\]*<br><br>&#x200B;<br><br>*\\[Scene changes with Drake continuing his attack on Sanji\\]*<br><br>**Drake:** Where do you think you're going. Ever since I heard the news about you being a vinsmoke, I wanted to meet you. However, I never knew, vinsmoke were these clumsy. You really thought you were done with me with such measly attack?<br><br>**Sanji:** STOP CALLING ME A VINSMOKE! I have no blood of that sick bloodline. And who you're calling clumsy, you piece of lizard-shit. *\\[Sanji coats his leg on fire and delivers a powerful blow to Drake's face at full speed\\]*<br><br>&#x200B;<br><br>**Page 10-11-12-13**<br><br>*\\[back at Udon prison, Big Mom continues to beat Queen. Their battle injures many of the fodders near by\\]*<br><br>**O-Lin:** Stop being so greedy and give me some o-shuriko.<br><br>**Queen:** NEVER! Don't get so full of yourself, just because your an emperor. I am QUEEN of the beast pirate. How dare you come to Wano and ruin my beautiful paradise of torture. Your gonna pay for all this you old hag<br><br>&#x200B;<br><br>*\\[In the midst of all the chaos, Caribou approaches Luffy and Hyo. Raizo, asks Luffy to take this opportunity to escape from the Prison right now. However, Luffy has still not figured out way to use his new skill. In addition to that the collar on their neck is a problem to get rid of\\]*<br><br>**Luffy:** Breaks his and Hyo's collar pretty easily.<br><br>*\\[Hyo, Raizo, Caribou make the enel face\\]*<br><br>**Hyo:** You could do t-tha..<br><br>**Luffy:** Yeah. Rayleigh back in sabody used this and I learned from him just in case if I ever get in trouble. Raizo, do me a favor and take boss hyo and that guy on the prison out of here. I will join you all soon. Now that I have had some good excersie on those cuffs while back, let's see what I can really do.<br><br>**Caribou:** \\*\\*\\*\\[\\*\\*\\**is he mad!!! Is he really trying to kill himself here facing such strong forces..I am worried if I made the right choice chosing this dumbass to escape from here\\]*<br><br>**Hyo:** Thank you straw-hat. I am indebted to you. I will make sure on my way out to recruit all the Yakuzas to help you all out.<br><br>**Luffy:** *\\[SMILES\\]* Okay, first let me get some back up. I hope its not too late, hang in there you two *\\[proceeds to rescue Kid and Killer\\]*<br><br>*\\[Big mom tires to attack Queen again using Prometheus, but out of nowhere, King appears and fights prometheus blaze of fire with his own and manages to blow away Big Mom for the time being\\]*<br><br>**Fodders: KING-SAMA!!!**<br><br>&#x200B;<br><br>**Page 14**<br><br>*\\[King and Queen tries to team up against the blown away Big Mom. But much to their surprise, Big Mom quickly recovers and blocks their attacks easily. Big Mom appears very pissed and for some reason has regained her memories\\]*<br><br>**O-LIN:** Long time no see brats! But, how easily have you forgotten, who you're messing with. *\\[Fiercely blows away queen and King\\]* Mugiwara....I am here!! *\\[Looks up in the sky and laughs\\]*<br><br>&#x200B;<br><br>**Kaido:** \\*\\*\\*\\[\\*\\*\\**rushing towards Udon\\]* I hope you're ready Linlin, You will regret coming to my domain. This time I will make sure to kill you.<br><br>&#x200B;<br><br>*BEASTS APPROACHES THE QUEEN!!!!! BREAK NEXT WEEK*"
    },
    "c60s9e": {
        "id": "c60s9e",
        "user": "Prmas",
        "created_on": "2019-06-27@14:06:38",
        "title": "One Piece Chapter 947 SPOILERS",
        "body": "Source: @EtenBoby<br><br>**Chapter Title:** Queen’s bet<br><br>**Info:**<br><br>\\- Luffy used the technique that was definitely used that Rayleigh back then, but he was so desperate during the process he couldn’t remember how exactly he was able to do it. <br><br>But what he just used surpasses the Ryuo that Grandpa Hyo was trying to taught him, if he could completely master it he’ll be able to save themselves from Big Mom’s punch.<br><br>\\- Luffy and Grandpa Hyo were blown away when they try it for the second time and failed, Grandpa Hyo is fine because he was guarding with Ryuo. <br><br>\\- Ryuo, or Haki, is an invisible armor that you can use for both defense and offense, but if you take it a stage farther, the Haki will become a power so great that it can reach the interior of the opponent’s body and destroy them from within.<br><br>\\- Even though Luffy destroyed the collars from within unconsciously, but it’s good enough, after saying that Grandpa Hyo fall to the ground...While chasing Luffy, Big Mom destroys the mine and head towards the melting furnace. If Queen couldn’t stop her, of course the others wouldn’t be able to as well.<br><br>\\- After regaining his consciousness, Queen has an idea and give out orders to his subordinates. If you head in a straight direction in Udon, you would definitely ended up coming back, when Big Mom actually came back,Queen uses oshiruko as a bait and attack her with Brachio Bombs which exploded on her head.<br><br>\\- The impact help her regains her memories, and became very energetic. Queen and the others thought they were doomed but she fall asleep. <br><br>\\- Taking this opportunity, Queen orders to tie her up with 100% pure seastone chain, which they wrap around her body 100 times, then injects her with 100% animal anesthesia. Aside from the minimum amount of guards, all of them needs to get on a boat and escort Big Mom to Onigashima before she wakes up. <br><br>\\- After Queen and his subordinates left, Babanuki is in charge of Udon. Udon is completely cut off from the rest of the world because of the snail situation. Luffy starts rampaging since there’s no more opponents."
    },
    "ceomqj": {
        "id": "ceomqj",
        "user": "Prmas",
        "created_on": "2019-07-18@16:06:06",
        "title": "One Piece Chapter 949 SPOILERS",
        "body": "**Sources:** @Redon, @hiktoj, @Etenboby<br><br>**Chapter Title: Zombie**<br><br>**Cover Page: It's about straw hats inside swimming pool with a large gorilla.**<br><br>**Full Description:**<br><br>\\- In order to stop Luffy and the others, the guards start shooting the Plague rounds made from viruses.<br><br>\\- Their target is not Luffy and his group, but all the prisoners.<br><br>\\- If you got hit you’ll get a infectious disease and feel burning pain until you die.<br><br>\\- It’s a weapon created by Queen, its name is Zombie.<br><br>\\- The guards command the infected prisoners to get close to Luffy’s group, they use them like biochemical weapon.<br><br>\\- The prisoners protest in pain: We wouldn’t be like this if you outsiders didn’t appear, it’s impossible for you guys to take down Kaidou, get out!<br><br>\\- Upon hearing this, Luffy touches them and yell: this kind of thing have no effect at all!<br><br>\\- He continues: I promised Otama that I’ll save this country, to let everyone eat to their hearts content, we are here to defeat Kaidou! There’s no reason for us to get stopped by our comrades, you guys decide whether you want to follow Kaidou or follow us!<br><br>\\- The prisoners were all moved by Luffy’s speech.<br><br>\\- Babanuki saw that this is not going well for them and decided to take advantage of them talking and hurl a large amount of Plague rounds at them.<br><br>\\- But it was put to a stop immediately by Luffy, who said because he saw a dangerous future.<br><br>\\- Then he turns to the prisoners: now, it’s up to you guys!<br><br>\\- 8 days till the final battle—successfully dominated Udon without being noticed by the enemy headquarter.<br><br>&#x200B;<br><br>**Pics:**<br><br>[*Shonen Jump Magazine Cover*](https://pbs.twimg.com/media/D_u2KLaWsAAPCh2?format=jpg&name=small)<br><br>[*Luffy getting poisoned*](https://pbs.twimg.com/media/D_vsfiYX4AYD6fZ?format=jpg&name=small)<br><br>[*Babanuki (Elephant Jailer) gets exploded*](https://pbs.twimg.com/media/D_v1rVJWwAETVVt?format=jpg&name=small)"
    },
    "cf3i0i": {
        "id": "cf3i0i",
        "user": "Kirosh",
        "created_on": "2019-07-19@15:22:24",
        "title": "One Piece: Chapter 949",
        "body": "**Chapter 949: \"Mummy\"**<br><br>**Source** | **Status**<br>:-----|:-----|:-----<br>[Official Release](https://mangaplus.shueisha.co.jp/viewer/1002336) | [](/tock)<br>[JaiminisBox](https://jaiminisbox.com/reader/read/one-piece-2/en/0/949/page/1) | [](/tick)<br><br>**One Shot by Boichi : Chapter 51 : Roronoa Zoro falls into the sea\"**<br><br>**Source** | **Status**<br>:-----|:-----|:-----<br>[Official Release]() | [](/tock)<br>[JaiminisBox](https://jaiminisbox.com/reader/read/one-piece-2/en/0/0/page/1) | [](/tick)<br><br><br>***<br><br>**[Ch.949 Official Release (VIZ):](https://mangaplus.shueisha.co.jp/titles/100020)** 21/07/2019<br><br>**Ch.950 Scan Release:** ~26/07/2019 ()<br><br>---<br><br>##Please discuss the manga here and in the theory/discussion post. Any other post will be removed during the next 24 hours.<br><br>---<br><br>**PS:** Don't forget to check out the official Discord: https://discord.gg/onepiece"
    },
    "cdtl37": {
        "id": "cdtl37",
        "user": "AutoModerator",
        "created_on": "2019-07-16@16:57:55",
        "title": "One Piece: Chapter 949 - Predictions",
        "body": "<br>Chapter 949 is just around the corner and it's the perfect time to leave your thoughts and comments on the upcoming chapter.<br><br>___<br>Join us at https://discord.gg/onepiece to discuss One Piece instantly with fellow nakama!"
    },
    "c9c6qy": {
        "id": "c9c6qy",
        "user": "Kirosh",
        "created_on": "2019-07-05@15:32:30",
        "title": "One Piece: Chapter 948",
        "body": "**Chapter 948: \"Kawamatsu the Kappa takes the stage\"**<br><br>**Source** | **Status**<br>:-----|:-----|:-----<br>[Official Release](https://mangaplus.shueisha.co.jp/viewer/1002336) | [](/tock)<br>[JaiminisBox](https://jaiminisbox.com/reader/read/one-piece-2/en/0/948/page/1) | [](/tick)<br>[Imgur Mirror](https://imgur.com/a/Clls4uS) | [](/tick)<br>***<br><br>**[Ch.948 Official Release (VIZ):](https://mangaplus.shueisha.co.jp/titles/100020)** 07/07/2019<br><br>**Ch.949 Scan Release:** ~19/07/2019 ()<br><br>---<br><br>##Please discuss the manga here and in the theory/discussion post. Any other post will be removed during the next 24 hours.<br><br>---<br><br>**PS:** Don't forget to check out the official Discord: https://discord.gg/onepiece"
    },
    "cdticw": {
        "id": "cdticw",
        "user": "MADKITTIEZ",
        "created_on": "2019-07-16@16:49:11",
        "title": "Bets and Bravery: Chapter 949!",
        "body": "So, with the release of the newest Vivre Card Databook (links to u/OharaLibrarianArtur's [post](https://redd.it/ccq0c6) and [databook analysis](https://thelibraryofohara.com/2019/07/13/vivre-card-databook-vol-11-all-the-new-information/)), we've become privy to the information that currently, Jack is only 28 years young, meaning he was only 8 at the time of Kaido's takeover of Wano. Oda, it's honestly ridiculous what you've done here. I mean, since I am reading a manga, especially one as crazy as One Piece, I've had to suspend my disbelief *quite* a bit by this point, but I draw the line when you're telling me a *kid* not even 10 years old was strong enough to help lead a military takeover of a powerful samurai nation. Even for One Piece, this is absolutely ridic--<br><br>Hrm? What's that?<br><br>[Oh.](https://www.youtube.com/watch?v=dvfE2pxYQFQ)<br><br>In other news, have you all heard the news about how good the Wano Arc is in the anime currently? Let me give you a sneak peek of how it looks. [Check it out](https://redd.it/cdrzg2).<br><br>###Links<br><br>* [Chapter 948 Betting Thread](https://redd.it/c85qfp)<br><br>* [Chapter 948 Results Thread](https://redd.it/caqnsg)<br><br>* [Overview Spreadsheet](https://docs.google.com/spreadsheets/d/17E8K6qalCQrzIKTEMeTEMdoeGwN70RBFdRcq8ft8mK8/edit?usp=sharing)<br><br>* [Fan-made Chapter 1000: \"One-on-one\"](https://redd.it/bsd64o)<br><br>Ladies and Gentlemen, Boys and Girls, and *everybody* in between, welcome back to...<br><br>#Bets and Bravery!<br><br>Welcome one, welcome all, we're glad to have you! If you're new to Bets and Bravery, B&B is a weekly thread on this subreddit where users bet with fake currency, the Beli from in-universe, on what they think will happen in each week's chapter in a series of bets made by yours truly. I keep track of everyone's money in a giant Google Sheet, which is available in the links above. So, if you're new, enjoy your time! But, if you're a regular on this thread, we're glad to see you back at r/OnePiece's unofficial official pasttime!<br><br>I hope you've all had a good week so far with whatever's been happening in your lives. If you haven't had such a good week so far, I'm wishing the best for you and hope I can brighten your day even a little bit with this post.<br><br>Before we get started, let's refresh your memory of last chapter to get you back on betting track!<br><br>##Last Time on One Piece<br><br>Luffy, still attempting to control his armament haki, is subdued by the Udon prisoners on order of Old Maid to avoid punishment from him and Kaido's forces. Daifugo prepares to execute Luffy with one of Queen's hand-made Plague Bullets until unique laughter emanates from the cell destroyed by Big Mom and Queen's fight. With his cage now open, the guards prepare to execute the prisoner once and for all since his poison execution never offed him. Raizo floats down to the cage and passes the prisoner a sword and the keys to his handcuffs, allowing Kawamatsu the Kappa to break free after 13 years of imprisonment. With a known Scabbard free, the guards are immediately nervous and prepare to execute him and the other prison intruders. Hyougoro speaks to Kiku and Raizo and asks them to reveal their identities in order to show the prisoners that there is still hope for Wano, at which point a fearsome lineup of 3 Scabbards, Hyougoro the Flower, and Luffytaro ~~Hey, what about me!?~~ squad up and prepare to combat the prison guards.<br><br>With that out of the way, let's get into the real meat of the thread...<br><br>#Chapter 948 Betting<br><br>##The Bets of the Week<br><br>###Bet 335<br><br>One of the most important players in the Udon Prison is currently MIA. No, I'm not talking about Queen or Big Mom, Kid or Killer, and definitely not the current lineup of Luffy and Co., I'm talking about \"Wet-Haired\" Caribou. Minor antagonist turned revolutionary, Caribou was captured by X Drake and imprisoned in Udon prior to the Strawhat Crew's arrival on the island. Upon Luffy's imprisonment, Caribou saw a chance to escape with his help and offered his services to the pirate, teaming up with Raizo to stop all communication with Udon from outside and find keys to prisoners' cages and handcuffs. However, since going to cut off outside communication, the super rookie has vanished from the story.<br><br>Despite showing genuine affection for other people such as Gaburu's grandmother during his time as a revolutionary throughout his Cover Story Serial, Caribou has always been a self-preserving kind of person, even abandoning his own brother on occasion as bait for pursuers ~~I mean, who *hasn't* asked their brother to launch a rescue mission for them only to steal his ship and leave him for dead? *Guilty!*~~ So, it isn't too far-fetched to assume that, free from his shackles and with communication cut, Caribou might have already fled from Udon. But doing that is just as risky as staying with the Strawhat Alliance, as he'd be alone in an enemy Yonkou's territory with enemies far stronger than he. Dear audience, where has Caribou gone, has he abandoned Luffy and Co.?<br><br>* A. Caribou has fled the Udon Complex and/or abandoned the Strawhats! Odds 1:2<br><br>* B. Caribou has not abandoned the Strawhats and has just not returned yet! Odds 1:3<br><br>###Bet 336<br><br>20 years of a tyrannical and oppressive reign will do a lot of things to a person's mental psyche and outlook on life, forcing them into submission being just one possibility. With Kaido and Orochi's stranglehold on Wano, prisoners and criminals don't really have much hope for opposing the established leadership in any way, shape or form. However, should there be someone or a group of people the oppressed can rally behind to oppose their abusive rulers, would they not fight for their freedom?<br><br>Well, I don't know how rallying behind a Kappa, a talking reindeer, a trap, a ninja with a head larger than some people, a rubber man, and an old geezer would give any semblance of hope, but it's all the prisoners of Udon have. With such big names as Hyougoro the Flower, the former yakuza head of all of Wano, Kikunojo the Lingering Snow, Kawamatsu the Kappa, and Raizo of the Mist, four powerful allies of the former ruling Kozuki Clan have appeared before the prisoners, just as Lady Toki once prophesied ~~\"Some weird dudes'll come beat up the guy with a sentient free-willed elephant on his chest and break you out of prison,\" -Lady Toki, probably~~ With Queen out of the picture and multiple powerhouses on their side, how will the prisoners react? Dear audience, will the Udon Prisoners be inspired to join the cause for overthrowing Kaido and Orochi?<br><br>* A. All of the prisoners will rally behind the Alliance! Odds 1:2<br><br>* B. Only some of the prisoners will join the cause! Odds 1:3<br><br>* C. The prisoners won't change their minds, Kaido and Orochi are too impossible to overcome! Odds 1:4<br><br>###Bet 337<br><br>> \"Even though Orochi's troops know our names we are saved by the fact that they do not truly believe of our presence. The most important part of this plan is to not be exposed. Our goal is to gather information in complete secrecy and take the commander's [Kaido] head!!\" -Kin'emon, One Piece Chapter 920<br><br>> \"Lol\" -Raizo, Kiku, Kawamatsu, One Piece Chapter 948<br><br>Despite making such a big deal about how important it is to keep hidden and not expose their identities to Kaido and Orochi's forces, literally no one is heeding Kin'emon's advice. Luffy fought Kaido directly, Zoro became a wanted criminal and then he and Sanji exposed themselves saving Toko, Law has been spotted by Hawkins, X Drake recognized Nami and Robin in the bathhouse, and now 3 of Oden's Scabbards are saying \"fuck that\" and exposing themselves to multiple headliners of the Beasts Pirates.<br><br>While in the short term it *could* sway the Udon Prisoners to their cause, with up to thousands of new allies joining the Alliance, in the long term it could be more of a hindrance. Unless every single prison guard is either cut down or imprisoned, any one of them could leak the return of the Scabbards to Orochi's forces. On top of that, with many thousands of possible new allies, how many of them would both stay out of trouble and not spill any beans? Even more so, as soon as Orochi and Kaido know exactly what they're up against, the secret plot to raid Onigashima is out the window as they'd probably just hunt down the Alliance beforehand. This is one plot point I'm excited to see the resolution of, so let's get speculating. Dear audience, will the return of Oden's Scabbards be passed on to Kaido and/or Orochi? <br><br>* A. Yes! Odds 1:2<br><br>* B. No, the Alliance will keep things under wraps in Udon! Odds 1:4<br><br>###Bet 338<br><br>This bet is where you can bet how many pages Chapter 949 will feature!<br><br>**Note:** Shounen Jump covers, fan art pages, or translator note pages from either Jaimini's Box or Mangastream are not counted here. Double page spreads are counted as two separate pages. Color pages and color spreads are counted. Cover story serials and fan-requested cover pages are counted.<br><br>* A. 16 or less pages! Odds 1:10<br><br>* B. 17 pages! Odds 1:1.2<br><br>* C. 18 or more pages! Odds 1:15<br><br>###Bet 339<br><br>Our final bet this week is about the main focus of this week's chapter! The chapter may cover multiple storylines, in which case, the correct answer will be whichever storyline the chapter gave the most attention to in terms of pages or panels, should it get that close!<br><br>* A. Luffy's adventure in the Udon Mines! Odds 1:2<br><br>* B. The chaos in the Flower Capital/Ratetsu Prison District! Odds 1:3<br><br>* C. Other storylines, such as Big Mom's escort, Kaido, Kin'emon and Ashura, or something outside of Wano! Odds 1:5<br><br>##Weekly Mini-game<br><br>With the reveal to the prisoners that Oden's Scabbards are alive and well, I figure this chapter should be centered on those very samurai. Dear audience, I want you to guess in how many panels one of Oden's Nine Red Scabbards appear!<br><br>* **Criteria for WMG:** One of Oden's [Nine Red Scabbards](https://onepiece.fandom.com/wiki/Nine_Red_Scabbards) appear in person in a panel.<br><br>* **Note:** We are counting the total number of panels that fit the criteria above. If a Scabbard is mentioned by name in dialogue but does not appear in person, that panel will not count toward the total. Also, while Kyoshiro is heavily theorized to be Denjiro ~~what kind of cursed timeline do we live in where the anime spoils the manga~~, unless we get a reveal for the Ninth Scabbard this chapter, he also will not count toward the total. If a panel features multiple Scabbards, the panel will only count once.<br><br>Guess 100% correctly on this, and you'll receive a whopping 1,500,000 Beli! If nobody guesses correctly, the closest answer receives 750,000 Beli! If multiple people guess correctly or are evenly close to the correct answer, the bounty is evenly split among them to the nearest 1,000 Beli!<br><br>##End of Chapter 949 Betting<br><br>And with that, we've made it through another exciting week of Betting and Bravery! I hope you enjoyed what we had this week, as I enjoyed making B&B for you!<br><br>Now, please listen to the following tutorial on how to play:<br><br>##Here's an example of a good comment:<br><br>> u/HyougoroTheBetter!! Show Bets and Bravery who you really are!!<br><br>> You are right... First, I must place on the leaderboard.<br><br>> 500K on 335B!<br><br>> 1M on 336A!<br><br>> 1M on 337A!<br><br>> 250K on 338B!<br><br>> 5M on 339A!<br><br>> 22 panels for the WMG!<br><br>> Who is this u/HyougoroTheBetter person, then!? This is playing out exactly like one of u/MADKITTIEZ's nonsensical rants about the economy going to ruin...<br><br>##Notes and Reminders<br><br>* Are you new to Bets and Bravery? If so, welcome, we're always glad to see newcomers! As a first login bonus, you'll get to start with 1,000,000 Beli to bet with however you want!<br><br>* Are all your bets ending up missing the mark? Have your bets and Beli ended up frozen and left you penniless? Worry not, just for showing up each week you get 10,000 Beli for free which you can jump right back into the betting with!<br><br>* *Please* bet in multiples of 1,000 Beli!<br><br>* *Please* bet on only one outcome (A, B, C, etc.) per bet (170, 171, 172, etc.)!<br><br>* Place all bets before spoilers drop for the chapter, cheating is a big no-no!<br><br>* Have any questions, comments, concerns, or ideas for future bets? Send me a message and I'll get right back to you!<br><br>##A Small message from u/MADKITTIEZ<br><br>For those of you who read my B&B Results Threads ~~s/o to you, ily~~ you may know that I *said* \"pre-production has started for my next fan-made chapter\" and, while I wasn't lying, all I've done is come up with a script. I've actually instead started work on *another* art project for One Piece in commemoration of the soon-upcoming 300K r/OnePiece subscriber celebration. It's gonna be an epic color spread of the Strawhats, so I hope that'll tide you over until the fan chapter gets here ~~eventually in probably a few months because I'm about to head off to college and that transition's gonna be crazy and I'll have to adjust to a new schedule and have a lot less free time and then I might forget about reddit entirely and then the inevitable B&B \"hiatus\" will arrive and everything goes to shit~~ in a reasonable amount of time.<br><br>Keep an eye out for the post!<br><br>#Thanks for Participating!<br><br>Thanks to everyone out there who dropped by to read this thread, whether all the way through, just skimming, or just dropping by to see what this thread was. I'm truly grateful you all come by and support my work here as much as you do, so thank you. I hope I can keep living up to your expectations as host!<br><br>I wish you all good luck on this week's bets, and I will see you all back later this week after the chapter drops and the results thread is out fo you all to see how you did! Until next time!<br><br>-MADKITTIEZ"
    }
}