{"c8xq79": {"id": "c8xq79", "user": "Prmas", "created_on": "2019-07-04@13:42:49", "title": "One Piece Chapter 948 SPOILERS", "body": "Source: @Etenboby and @sil5r<br><br>**Chapter Title: Introducing Kawamatsu the Kappa**<br><br>**New cover story: “The Fire Tank Pirates that had successfully escaped”**<br><br>**Info:**<br><br>To make sure things doesn’t get out of control, the prisoners stop Luffy.<br><br>In order to give the prisoners hope and to get them out of Luffy’s way, Kawamatsu receives the key and someone’s favorite sword and break out.<br><br>Okiku and Raizou has revealed their identities, and they sees that Grandpa Hyo really is Hyogoro.<br><br>Okiku is going to stop them from reporting to Kaido.<br><br>&#x200B;<br><br>***Break next week***<br><br>(The Info will get updated)<br><br>&#x200B;<br><br>**Additional Info:**<br><br>\\- Kiku's epithet is Remaining Snow.<br><br>\\- This chapter consists of 17 pages.<br><br>\\- A new kind of sword appears in the chapter. It's called **Love Sword** (愛刀) or something like that.<br><br>\\- Kawamatsu used to be the strongest Sumo wrestler. As wolfwood mentioned, Kawamatsu's first name Yokozuna is given to strongest Sumo wrestler.<br><br>\\- His sword is called Soto-musou (Sumo technique)<br><br>\\- Luffy is still fighting Queen's subordinates with Ryuo and Hyo watching him<br><br>\\- The prisoners trying to chain Luffy after Queen's subordinates arrange themselves and the leaders of the prison intervene to stop them<br><br>\\- When the prisoners trying to stop Luffy it's a comedy panel<br><br>\\- Queen's subordinates trying to enter Kawamatsu jail<br><br>\\- While Kawamastsu is inside his shadow appears (silhouette)<br><br>\\- Out of sudden Raizou appears flying in front of everyone then threw the sword and the key to Kawamatsu<br><br>\\- Kawamatsu free himself<br><br>\\- Even while Kawamatsu opening the cuffs he was in silhouette with his sword<br><br>\\- Then he killed 4 of Queen's subordinates<br><br>\\- Raizou and Kiku going to Kawamatsu while they smiling<br><br>\\- Kiku keeps the prisoners away from Luffy<br><br>\\- Raizou and Kiku recognize Hyo<br><br>\\- Last page they are in a wonderful panel<br><br>&#x200B;<br><br>**Raw Pics:**<br><br>[***Kawamatsu Reveal***](https://i.imgur.com/2l7Ww73.jpg)<br><br>Translation: \"Retainer of the Kouzuki Clan Kawamatsu the Yokozuna.<br><br>Kawamatsu: Kawamatsu the Kappa!!! Will now join the battle!!!\"<br><br>[***Last page (Kiku transformed into a demon?)***](https://i.imgur.com/hTVKY0d.jpg)<br><br>Translation: \"Raizou: True, we are just the ghosts!!!<br><br>Chopper:Huh?!! You’re a man?!<br><br>Okiku: I’m a girl at heart.<br><br>Chopper(?): Your face is scary!!<br><br>Beasts Pirates: He’s the rival ninja of Fukurokuju, “Raizou of the Mist”!!<br><br>Beasts Pirates: Then who’s Luffytarou?!!<br><br>Babanuki: This is like those jokes lord Orochi brought up. I have to report this to Kaido-san somehow!!!<br><br>Okiku: No......now that you’ve seen it, I would have to close your mouth\"<br><br>[***Kiku***](https://i.imgur.com/ZafaQQZ.jpg)<br><br>[***The Group standing badass***](https://i.imgur.com/fypg162.jpg)<br><br>[***Kawamatsu funny panel and Old Maid***](https://i.imgur.com/p20FdN5.jpg)<br><br>[***Kawamatsu Fighting 1***](https://i.imgur.com/jbVPbt8.jpg)<br><br>[***Kawamatsu Fighting 2***](https://i.imgur.com/8DDnCRs.jpg)<br><br>Translation: \"Beasts Pirates: Ah!!<br><br>Kawamatsu: You made it in time......Raizou......<br><br>It’s been a while, my favorite sword “Sotomusou”!<br><br>You guys......do you like Sumo?\"<br><br>[***First Page***](https://i.imgur.com/9zy3R8B.jpg)"}, "c2div9": {"id": "c2div9", "user": "dooperco", "created_on": "2019-06-19@16:24:21", "title": "One Piece Coloring - The Boys Are Back In Town (Chapter 943 spoilers)", "body": ""}, "c0aeui": {"id": "c0aeui", "user": "ipagera", "created_on": "2019-06-14@05:44:41", "title": "Морска градина Бургас vs. Mорска градина Варна? Which one's best?", "body": "Колеги, като чистокръвен варналия, седящ си на работа, тършувайки из редит, мислейки за прекрасностите в морската градина на Варна и сладките ми спомени да пия двулитровки Каменица/Загорка на някоя пейка с приятели, се замислих дали в същия момент има някакъв бургаслия, който е в подобна ситуация. И, още по-важно - Коя морска градина е по-хубава и защо? <br><br>Моят отговор, предполагам е ясен, понеже съм biased и тн., но какво мислите, членове на r/bulgaria? <br><br>От един варналия<br><br><br>EDIT: TEST TEST TEST"}, "byvvnz": {"id": "byvvnz", "user": "bibek070", "created_on": "2019-06-10@19:47:01", "title": "One Piece Chapter 946 prediction |Spoilers Ahead for Anime Watchers]", "body": "It's been a while since I did this, but here it goes again- let the imagination-imagination no mi run wild<br><br>&#x200B;<br><br>**CHAPTER 946 ESCAPE**<br><br>&#x200B;<br><br>**Page 1-2**<br><br>\\[*Shutenmaru takes everyone towards their current hideout. \\]*<br><br>&#x200B;<br><br>**Shutenmaru:** It's been 20 years since I last saw a man like Oden to walk on the face of Wano. 9 scabbards-pff- what a joke. We're only low life criminals to whom Oden gave a ray of hope to live a better life. But when the time came to guard our shogun, we failed miserably- and see for yourself where the country has been to.<br><br>&#x200B;<br><br>**Kinemon:** I take full responsibility as the lead--<br><br>&#x200B;<br><br>**Shutenmaru:** Shut up! You are no leader. What makes you think you're the leaders. It's not you who have been working in the shadows and looking after the nation ever since that monster and that good for nothing Orochi came  and plotted such heinous act on this land. You have no right to call yourself a leader. I will never be a part of the nine scabbards. But, I will, for Oden's sake, for Lady Toki's promise, will fight along side you and your little buddies you've brought along.<br><br>&#x200B;<br><br>**Kinemon**: *\\[bows down* \\]Thank you! It means a lot.<br><br>&#x200B;<br><br>**Shutenmaru:** However, don''t assume everyone else have the same devotion towards this nation as they did 20 years ago. Things have changed. But, if we ever are going to take down that monster and slay that bastard Orochi- there's something we will need. Follow me inside...<br><br>&#x200B;<br><br>**Page 3-4**<br><br>\\[*Kaido has been reported about Big Mom's arrival at Udon. Kaido is briefed about Queen situation.\\]*<br><br>**Kaido:** THAT GOOD FOR NOTHING KING! Inform him immediately and ask him to aid Queen right now. If he does not fixes his mess, I will personally teach these bastards what torture really is.<br><br>**Bed wetting Fodders:** Y-Yes.. K-k-kaido-sama<br><br>**Kaido:** That Old Hag, how dare she talk to me about favors. I asked none from her. That was more than 40 years ago. If it was not for ***him*** I would have slaughtered that witch long time ago.<br><br>&#x200B;<br><br>**Page 5-6-7**<br><br>*\\[Scene continues between Zoro and Kyoshiro. While Zoro pulls out few of his move set, Kyoshiro, just calmly deflects them rather easily. Kyoshiro on the other hand does not make much of an \"attacks\" on Zoro despite Zoro's relentless and barrages of air slash at kyoshiro\\]*<br><br>\\*\\*Zoro: \\[\\*\\**stands still and relaxes his swords\\]*  Why are you doing this? And why do I sense hesitation in your attacks? If you think I am some weak swordsmen, then before you make the next move, I will slice you up and behead your master straight away.<br><br>&#x200B;<br><br>\\*\\*Kyoshiro:  \\[\\*\\**Laughs \\]* How scary. I am almost crying here with fear. If you can sense hesitation in my attack then you can also sense how strong I am, don't you? I am not showing you any sympathy or doing you favors. You are waste of my time. I am a samurai- and my skills are beyond your imagination. You're just merely a criminal and a low life pirate, who pretends to wield a sword and disrespects its origin. I bet your master was some scumbag who made you believe, you can be a swordsman..what a joke.<br><br>&#x200B;<br><br>**Zoro:** How dare you speak of my master Koushiro. That's it, I will kill you if I have to in order to take that bastards head..<br><br>&#x200B;<br><br>**Kyoshiro: \\[** *did he just said Koushiro- sweats a bit \\]*<br><br>&#x200B;<br><br>**Page 8-9-10**<br><br>**Law:** How dare you take my crew captive. If any thing happens to them, I will kill you..<br><br>**Hawkins:** You can try if you want to, but you won't be able to put a scratch on me. You actions will affect your crew greatly. So, stop resisting and come along quietly, or there'll be serious consequences.<br><br>**Law:** *\\[Smiles\\]* You expect me to be cowards like you and serve under some emperor. I thought, we're from the same reckless and fearsome worst generation. I guess, facing a Yonkou has made you soft basil hawkins.<br><br>**Hawkins:**  \\*\\*\\*\\[\\*\\*\\**stares at law with anger\\]*<br><br>&#x200B;<br><br>*\\[Scene changes with Drake continuing his attack on Sanji\\]*<br><br>**Drake:** Where do you think you're going. Ever since I heard the news about you being a vinsmoke, I wanted to meet you. However, I never knew, vinsmoke were these clumsy. You really thought you were done with me with such measly attack?<br><br>**Sanji:** STOP CALLING ME A VINSMOKE! I have no blood of that sick bloodline. And who you're calling clumsy, you piece of lizard-shit. *\\[Sanji coats his leg on fire and delivers a powerful blow to Drake's face at full speed\\]*<br><br>&#x200B;<br><br>**Page 10-11-12-13**<br><br>*\\[back at Udon prison, Big Mom continues to beat Queen. Their battle injures many of the fodders near by\\]*<br><br>**O-Lin:** Stop being so greedy and give me some o-shuriko.<br><br>**Queen:** NEVER! Don't get so full of yourself, just because your an emperor. I am QUEEN of the beast pirate. How dare you come to Wano and ruin my beautiful paradise of torture. Your gonna pay for all this you old hag<br><br>&#x200B;<br><br>*\\[In the midst of all the chaos, Caribou approaches Luffy and Hyo. Raizo, asks Luffy to take this opportunity to escape from the Prison right now. However, Luffy has still not figured out way to use his new skill. In addition to that the collar on their neck is a problem to get rid of\\]*<br><br>**Luffy:** Breaks his and Hyo's collar pretty easily.<br><br>*\\[Hyo, Raizo, Caribou make the enel face\\]*<br><br>**Hyo:** You could do t-tha..<br><br>**Luffy:** Yeah. Rayleigh back in sabody used this and I learned from him just in case if I ever get in trouble. Raizo, do me a favor and take boss hyo and that guy on the prison out of here. I will join you all soon. Now that I have had some good excersie on those cuffs while back, let's see what I can really do.<br><br>**Caribou:** \\*\\*\\*\\[\\*\\*\\**is he mad!!! Is he really trying to kill himself here facing such strong forces..I am worried if I made the right choice chosing this dumbass to escape from here\\]*<br><br>**Hyo:** Thank you straw-hat. I am indebted to you. I will make sure on my way out to recruit all the Yakuzas to help you all out.<br><br>**Luffy:** *\\[SMILES\\]* Okay, first let me get some back up. I hope its not too late, hang in there you two *\\[proceeds to rescue Kid and Killer\\]*<br><br>*\\[Big mom tires to attack Queen again using Prometheus, but out of nowhere, King appears and fights prometheus blaze of fire with his own and manages to blow away Big Mom for the time being\\]*<br><br>**Fodders: KING-SAMA!!!**<br><br>&#x200B;<br><br>**Page 14**<br><br>*\\[King and Queen tries to team up against the blown away Big Mom. But much to their surprise, Big Mom quickly recovers and blocks their attacks easily. Big Mom appears very pissed and for some reason has regained her memories\\]*<br><br>**O-LIN:** Long time no see brats! But, how easily have you forgotten, who you're messing with. *\\[Fiercely blows away queen and King\\]* Mugiwara....I am here!! *\\[Looks up in the sky and laughs\\]*<br><br>&#x200B;<br><br>**Kaido:** \\*\\*\\*\\[\\*\\*\\**rushing towards Udon\\]* I hope you're ready Linlin, You will regret coming to my domain. This time I will make sure to kill you.<br><br>&#x200B;<br><br>*BEASTS APPROACHES THE QUEEN!!!!! BREAK NEXT WEEK*"}, "c60s9e": {"id": "c60s9e", "user": "Prmas", "created_on": "2019-06-27@14:06:38", "title": "One Piece Chapter 947 SPOILERS", "body": "Source: @EtenBoby<br><br>**Chapter Title:** Queen’s bet<br><br>**Info:**<br><br>\\- Luffy used the technique that was definitely used that Rayleigh back then, but he was so desperate during the process he couldn’t remember how exactly he was able to do it. <br><br>But what he just used surpasses the Ryuo that Grandpa Hyo was trying to taught him, if he could completely master it he’ll be able to save themselves from Big Mom’s punch.<br><br>\\- Luffy and Grandpa Hyo were blown away when they try it for the second time and failed, Grandpa Hyo is fine because he was guarding with Ryuo. <br><br>\\- Ryuo, or Haki, is an invisible armor that you can use for both defense and offense, but if you take it a stage farther, the Haki will become a power so great that it can reach the interior of the opponent’s body and destroy them from within.<br><br>\\- Even though Luffy destroyed the collars from within unconsciously, but it’s good enough, after saying that Grandpa Hyo fall to the ground...While chasing Luffy, Big Mom destroys the mine and head towards the melting furnace. If Queen couldn’t stop her, of course the others wouldn’t be able to as well.<br><br>\\- After regaining his consciousness, Queen has an idea and give out orders to his subordinates. If you head in a straight direction in Udon, you would definitely ended up coming back, when Big Mom actually came back,Queen uses oshiruko as a bait and attack her with Brachio Bombs which exploded on her head.<br><br>\\- The impact help her regains her memories, and became very energetic. Queen and the others thought they were doomed but she fall asleep. <br><br>\\- Taking this opportunity, Queen orders to tie her up with 100% pure seastone chain, which they wrap around her body 100 times, then injects her with 100% animal anesthesia. Aside from the minimum amount of guards, all of them needs to get on a boat and escort Big Mom to Onigashima before she wakes up. <br><br>\\- After Queen and his subordinates left, Babanuki is in charge of Udon. Udon is completely cut off from the rest of the world because of the snail situation. Luffy starts rampaging since there’s no more opponents."}}